app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "This is how you do UJS."], ["created_at", "2014-10-15 04:25:13.445124"], ["title", "UJS Tutorial"], ["updated_at", "2014-10-15 04:25:13.445124"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "content" = $1, "title" = $2, "updated_at" = $3 WHERE "posts"."id" = 3  [["content", "Here it is."], ["title", "Rails UJS tutorial"], ["updated_at", "2014-10-20 03:29:18.313872"]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "posts".* FROM "posts"
---
    def set_posts
      @post = Post.new
      @post = Post.find(params[:id]) if params[:id]
      @posts = Post.all